{
    "titleOutcome": "Learning outcome",
    "descriptionOutcome": "The programme’s goal is to qualify graduates to independently design, plan, realise and manage digital media tasks and to assist in the implementation, administration and maintenance of digital media productions. The graduate will engage in development-oriented activities, including undertaking the analysis, ideation, design and planning, as well as realisation and management of digital media tasks, being innovative in tailoring digital media solutions to commercial conditions.Will also acquire new knowledge, skills and competencies and participate in disciplinary / interdisciplinary cooperation within digital media in connection with implementation, administration and maintenance, taking a professional approach."
},

{
    "article": [
        {
            "image": "userInterfacedevelopment420x280px",
            "name": "User Interface development",
            "slogan": "More than just designing",
            "outcome": [
    "Production of user interfaces", "Development of digital solutions", "Digital media Planning", "Digital media Design"]
        },
        {
            "image": "userexperience420x280px",
            "name": "User Experience",
            "slogan": "Life taste better with UX",
            "outcome": [
    "Design and development of digital experiences", "Understanding of user", "User interaction", "Testing solutions"]

        },
        {
            "image": "contentproduction420x280px",
            "name": "Content production",
            "slogan": "The Web Designer Dream",
            "outcome": [
    "Understanding digital media", "Types of content", "Dissemination", "Use of data"]

        },
        {
            "image": "business420x280px",
            "name": "Business",
            "slogan": "Exploring the design's role",
            "outcome": [
    "business models", "data understanding", "basis of a business existence", "value chain"]

        },
        {
            "image": "technology420x280px",
            "name": "Technology",
            "slogan": "Let the artist inside you roll",
            "outcome": [
    "Technologies understanding in digital media", "Exploration of technologies in digital media"]

        }
    ]
},

{
    "titleDate": "Effective date",
    "descriptionDate": "The curriculum takes effect on 1 August 2018 and applies to students enrolled on the programme after this date. However will also transfer to all students who have been admitted up until 1 August 2018."
},

{
 "section": [
        {
            "titleSemester": "1 Semester",
            "descriptionSemester": "The 1st Semester contains 2 program elements.",
            "subtitle1Semester": "Digital user interface",
            "descriptionSubtitle1": "This programme element covers basic principles for the design and programming of digital solutions, with a particular focus on the design and structuring of the user interface. Also  including user-centred methods for design and solution testing.",
            "outcomeSubtitle":"Knowledge and skills acquired:",
            "outcomePoints1": [
                "Development methods for digital media production.",
                "Methods applied by the profession in connection with user testing.",
                "Basic principles for composition and layout.",
                "Practice-oriented design processes and documentation forms.",
                "Basic methods for modelling, structuring and developing digital user interfaces.",
                "Key technologies applied, including client-server relations.",
                "Plan and conduct user tests.",
                "Document key processes in the design and development."
            ],
            "points": "ECTS points: 15",
            "subtitle2Semester": "Digital Content",
            "descriptionSubtitle2": "This programme element covers the design, programming and production of simple digital content solutions for selected media platforms.  Solutions are designed, programmed and produced on the basis of a content and business strategy.",
            "outcomePoints2": [
                "Understanding of intellectual property rights and licensing methods.",
                "Multimedia designer’s role in the value chain.",
                "Digital media and digital media platforms.",
                "Key forms of expression and content.",
                "Key technologies applied by the profession.",
                "Basic methods and theories regarding user understanding.",
                "Empirical data about users and situations of use.",
                "Produce basic-level digital content.",
                "Communicate the development process."
            ],
            "electives": [],
            "button": false,
        },
        {
           "titleSemester": "2 Semester",
            "descriptionSemester": "The 2 Semester contains 2 program elements.",
            "subtitle1Semester": "Digital user interface",
            "descriptionSubtitle1": "This programme element covers the design and programming of complex digital solutions with a special focus on user interfaces. Solutions are designed and programmed in teams using key methods for testing the user experience.",
            "outcomeSubtitle": "Knowledge and skills acquired:",
            "outcomePoints1": [
                "Understanding of the company’s external environment.",
                "Key technologies for data management to user experiences.",
                "Key methods and tools related to project management and estimation.",
                "Theories, tools and methods for the design and programming of digital user experiences.",
                "Current programming paradigms for complex digital user interfaces.",
                "Plan and assess project management in team-based.",
                "Apply and document key design processes.",
                "Communicate and explain solutions.",
                "Assess and apply a user-centred method.",
            ],
            "points": "ECTS points: 15",
            "subtitle2Semester": "Digital Content",
            "descriptionSubtitle2": "This programme element covers the design and programming of complex digital content solutions for multiple types of media. In the production of content, technologies are applied to manage and present content, and communication of data forms.",
            "outcomePoints2": [
                "Tools and data applied in the profession.",
                "Methods and theories applied for complex digital content production.",
                "Methods and theories applied for the presentation of data.",
                "Technologies used to store and exchange data.",
                "Business models.",
                "Key methods and theories of digital user experiences.",
                "Project management in user-centred content production.",
                "Communicate and justify digital solutions.",
                "Key technologies for handling and displaying digital content.",
            ],
            "electives": [],
            "button": false,
        },
       {
           "titleSemester": "3 Semester",
            "descriptionSemester": "Tha 3rd Semester programme elements equates to a total of 30 ECTS points which are organised taking into account local / regional needs and must include electives related to at least 5 ECTS points.",
            "subtitle1Semester": "Electives",
            "descriptionSubtitle1": "",
            "outcomeSubtitle": "",
            "outcomePoints1": [],
            "points": "ECTS points: 30",
            "subtitle2Semester":"",
            "descriptionSubtitle2": "",
            "outcomePoints2": [],
            "electives": [
                "Option 1: Digital Design og Indhold (taught in Danish)",
                "Option 2: Persuasive Content (taught in English)",
                "Option 3: FrontEnd Design (taught in English)",
            ],
           "button": false,
        },
        {
           "titleSemester": "4 Semester",
            "descriptionSemester": "The 4th semester consists in arranging an internship in multimedia design field and a final exam project.",
            "subtitle1Semester": "Internship",
            "descriptionSubtitle1": "The internship is equivalent to 15 ECTS points and is concluded with a single exam.",
            "outcomeSubtitle": "",
            "outcomePoints1": [],
            "points": "ECTS points: 30",
            "subtitle2Semester":"Final Exam Project",
            "descriptionSubtitle2": "The learning objectives for the final exam project are identical to the learning objectives for the programme. This exam will be the one that concludes the programme in the last semester when all other exams have been passed.",
            "outcomePoints2": [],
            "electives": [],
            "button": true,
        }
    ]
},

{
    "titleInter": "Internship",
    "descriptionInter": "The student should gained development-based knowledge and an understanding of requirements and expectations of companies but also practice-related use of theories, methods and tools by the profession.Should also acquire skills needed to assess and communicate practice-oriented issues, and present possible solutions.As result the student will gather new knowledge, skills and competencies of relevance to the profession and undertake the structuring and planning of day-to-day tasks.",
    "pointsInter": "ECTS points: 15",
},
{
    "exams": [
        {
            "titleExam": "Exams",
            "descriptionsExam": "In the first year of study, national programme elements equate to 60 ECTS points, of which a minimum of 45 ECTS points are included in the exam(s).The first-semester exam, which equates to 30 ECTS points, is held after the first semester. The second-semester exam, which equates to 30 ECTS points, is held after the second semester. In addition, a single exam is held in the 3th semesters, equivalent to 30 ECTS points, as well as an additional single exam in the final exam project and Internship with 15 ECTS points each.",
            "pointsExam": "So the MMD programme corresponds to a total of 120 ECTS points.",
        },
      {
            "titleExam": "Final Exam Project",
            "descriptionsExam": "The final exam project must document the student’s understanding of practice and key applied theories and methods, based on a specific assignment within the area of the programme. The problem statement must be central to the programme / profession and be prepared by the student.  Alternatively and upon approval, the final exam project can be based on the student starting up his or her own business. The project concludes with a report and a product of a digital media production. The Report must not exceed 30 standard pages for one student + 10 standard pages for each additional group member without counting the front page, table of contents, bibliography and appendices. A standard page is 2,400 characters with spaces and footnotes. The exam will consist of an oral and a written part with an external co-examiner, where a single grade, according to the 7-point grading scale, is awarded for the written project and the oral performance.",
            "pointsExam": "ECTS points: 15",
        },
    ]
},

{
    "titleCredit": "Credit transfer rules",
    "descriptionCredit": "Successfully completed programme elements are equivalent to the corresponding programme elements at other educational institutions. Students are obliged to provide information on completed programme elements from other Danish or foreign higher education and on any related employment. The decision is based on an academic evaluation. In case of pre-approval, the student is obliged, after completing the period of study, to document the programme elements completed during the approved period of study. If a credit transfer is granted, programme elements are deemed to have been completed"
}
