{
 "section": [
        {
            "titleSemester": "1 Semester",
            "descriptionSemester": "The 1st Semester contains 2 program elements.",
            "subtitle1Semester": "Digital user interface",
            "descriptionSubtitle1": "This programme element covers basic principles for the design and programming of digital solutions, with a particular focus on the design and structuring of the user interface. Also  including user-centred methods for design and solution testing.",
            "outcomeSubtitle":"Knowledge and skills acquired:",
            "outcomePoints1": [
                "Development methods for digital media production.",
                "Methods applied by the profession in connection with user testing.",
                "Basic principles for composition and layout.",
                "Practice-oriented design processes and documentation forms.",
                "Basic methods for modelling, structuring and developing digital user interfaces.",
                "Key technologies applied, including client-server relations.",
                "Plan and conduct user tests.",
                "Document key processes in the design and development."
            ],
            "points": "ECTS points: 15",
            "subtitle2Semester": "Digital Content",
            "descriptionSubtitle2": "This programme element covers the design, programming and production of simple digital content solutions for selected media platforms.  Solutions are designed, programmed and produced on the basis of a content and business strategy.",
            "outcomePoints2": [
                "Understanding of intellectual property rights and licensing methods.",
                "Multimedia designer’s role in the value chain.",
                "Digital media and digital media platforms.",
                "Key forms of expression and content.",
                "Key technologies applied by the profession.",
                "Basic methods and theories regarding user understanding.",
                "Empirical data about users and situations of use.",
                "Produce basic-level digital content.",
                "Communicate the development process."
            ],
            "electives": [],
            "button": false,
        },
        {
           "titleSemester": "2 Semester",
            "descriptionSemester": "The 2 Semester contains 2 program elements.",
            "subtitle1Semester": "Digital user interface",
            "descriptionSubtitle1": "This programme element covers the design and programming of complex digital solutions with a special focus on user interfaces. Solutions are designed and programmed in teams using key methods for testing the user experience.",
            "outcomeSubtitle": "Knowledge and skills acquired:",
            "outcomePoints1": [
                "Understanding of the company’s external environment.",
                "Key technologies for data management to user experiences.",
                "Key methods and tools related to project management and estimation.",
                "Theories, tools and methods for the design and programming of digital user experiences.",
                "Current programming paradigms for complex digital user interfaces.",
                "Plan and assess project management in team-based.",
                "Apply and document key design processes.",
                "Communicate and explain solutions.",
                "Assess and apply a user-centred method.",
            ],
            "points": "ECTS points: 15",
            "subtitle2Semester": "Digital Content",
            "descriptionSubtitle2": "This programme element covers the design and programming of complex digital content solutions for multiple types of media. In the production of content, technologies are applied to manage and present content, and communication of data forms.",
            "outcomePoints2": [
                "Tools and data applied in the profession.",
                "Methods and theories applied for complex digital content production.",
                "Methods and theories applied for the presentation of data.",
                "Technologies used to store and exchange data.",
                "Business models.",
                "Key methods and theories of digital user experiences.",
                "Project management in user-centred content production.",
                "Communicate and justify digital solutions.",
                "Key technologies for handling and displaying digital content.",
            ],
            "electives": [],
            "button": false,
        },
       {
           "titleSemester": "3 Semester",
            "descriptionSemester": "Tha 3rd Semester programme elements equates to a total of 30 ECTS points which are organised taking into account local / regional needs and must include electives related to at least 5 ECTS points.",
            "subtitle1Semester": "Electives",
            "descriptionSubtitle1": "",
            "outcomeSubtitle": "",
            "outcomePoints1": [],
            "points": "ECTS points: 30",
            "subtitle2Semester":"",
            "descriptionSubtitle2": "",
            "outcomePoints2": [],
            "electives": [
                "Option 1: Digital Design og Indhold (taught in Danish)",
                "Option 2: Persuasive Content (taught in English)",
                "Option 3: FrontEnd Design (taught in English)",
            ],
           "button": false,
        },
        {
           "titleSemester": "4 Semester",
            "descriptionSemester": "The 4th semester consists in arranging an internship in multimedia design field and a final exam project.",
            "subtitle1Semester": "Internship",
            "descriptionSubtitle1": "The internship is equivalent to 15 ECTS points and is concluded with a single exam.",
            "outcomeSubtitle": "",
            "outcomePoints1": [],
            "points": "ECTS points: 30",
            "subtitle2Semester":"Final Exam Project",
            "descriptionSubtitle2": "The learning objectives for the final exam project are identical to the learning objectives for the programme. This exam will be the one that concludes the programme in the last semester when all other exams have been passed.",
            "outcomePoints2": [],
            "electives": [],
            "button": true,
        }
    ]
},
